app/controllers/relationships_controller.rb

DELETE FROM "relationships" WHERE "relationships"."id" = ?  [["id", 1]]
---
  def destroy
    current_user.unfollow(params[:user_id])
    relationship.destroy