app/models/user.rb

DELETE FROM "relationships" WHERE "relationships"."id" = ?  [["id", 1]]
---
  def unfollow(user_id) #フォローを外す
    relationship = self.follower.find_by(followed_id: user_id)
    relationship.destroy if relationship